read_verilog /doc/xzh/work_2/resamplecours/fuzz_811/simulation_vivado/rtl.v
synth_design -part xc7k70t -top top
write_verilog -force /doc/xzh/work_2/resamplecours/fuzz_811/simulation_vivado/syn_vivado.v